Revit 2024 API
BendingDetailCustomFieldProperties.AngularDimensionsDisplayOption Property
 Identifies the angular dimensions display options.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public BendingDetailAngularDimensionsDisplayOptions AngularDimensionsDisplayOption { get; set; }
Visual Basic
Public Property AngularDimensionsDisplayOption As BendingDetailAngularDimensionsDisplayOptions
	Get
	Set
Visual C++
public:
property BendingDetailAngularDimensionsDisplayOptions AngularDimensionsDisplayOption {
	BendingDetailAngularDimensionsDisplayOptions get ();
	void set (BendingDetailAngularDimensionsDisplayOptions value);
}
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentOutOfRangeException |  When setting this property: A value passed for an enumeration argument is not a member of that enumeration
See Also
BendingDetailCustomFieldProperties Class
Autodesk.Revit.DB.Structure Namespace